controllers/ClienteController.php

    public function actionCadastrar($tipoCliente = null){
        $model = new Cliente();// render('views',['array'=> $variavelmodel])
        $fisico = new ClienteFisico();
        $juridico = new ClienteJuridico();
        $contato = new ClienteContato();
        $endereco = new ClienteEndereco();

        if ($model->load(Yii::$app->request->post())){// load(Carrega os dados para o post e salva)
            if($model->validate()){
                $model->id_usuario_fk=1; // quem tá cadastrando
                if(isset($_POST['ClienteFisico'])){
                    $fisico->load(yii::$app->request->post());

                        $model->save(false); // salva os atributos da classe cliente
                        $fisico->id_cliente_fk = $model->id_cliente;
                        $fisico->save(false); // salva em cliente fisico
---
INSERT INTO "tb_cliente" ("no_cliente", "dt_cadastro", "id_usuario_fk") VALUES ('Alacy', '2020-01-01', 1) RETURNING "id_cliente"
INSERT INTO "tb_cliente_fisico" ("co_cpf", "co_rg", "dt_nascimento", "id_cliente_fk") VALUES ('12312312300', '321321', '2020-01-01', 7045)

    public function actionAtualizar($id){
        $model = $this->buscarModelo($id);
        $fisico = ClienteFisico::find()->where(['id_cliente_fk'=> $id])->one();
        $juridico = ClienteJuridico::find()->where(['id_cliente_fk'=>$id])->one();
        $contato = ClienteContato::find()->where(['id_cliente_fk'=>$id])->one();
        $endereco = ClienteEndereco::find()->where(['id_cliente_fk'=>$id])->one();
---
SELECT * FROM "tb_cliente_fisico" WHERE "id_cliente_fk"='1'
SELECT * FROM "tb_cliente_juridico" WHERE "id_cliente_fk"='1'
SELECT * FROM "tb_cliente_contato" WHERE "id_cliente_fk"='1'
SELECT * FROM "tb_cliente_endereco" WHERE "id_cliente_fk"='1'